{
  "_name_or_path": "distilbert-base-uncased",
  "activation": "gelu",
  "architectures": [
    "DistilBertForSequenceClassification"
  ],
  "attention_dropout": 0.1,
  "dim": 768,
  "dropout": 0.1,
  "hidden_dim": 3072,
  "id2label": {
    "0": "ACCOUNTANT",
    "1": "ADVOCATE",
    "2": "AGRICULTURE",
    "3": "APPAREL",
    "4": "ARTS",
    "5": "AUTOMOBILE",
    "6": "AVIATION",
    "7": "BANKING",
    "8": "BPO",
    "9": "BUSINESS-DEVELOPMENT",
    "10": "CHEF",
    "11": "CONSTRUCTION",
    "12": "CONSULTANT",
    "13": "DESIGNER",
    "14": "DIGITAL-MEDIA",
    "15": "ENGINEERING",
    "16": "FINANCE",
    "17": "FITNESS",
    "18": "HEALTHCARE",
    "19": "HR",
    "20": "INFORMATION-TECHNOLOGY",
    "21": "PUBLIC-RELATIONS",
    "22": "SALES",
    "23": "TEACHER"
  },
  "initializer_range": 0.02,
  "label2id": {
    "ACCOUNTANT": 0,
    "ADVOCATE": 1,
    "AGRICULTURE": 2,
    "APPAREL": 3,
    "ARTS": 4,
    "AUTOMOBILE": 5,
    "AVIATION": 6,
    "BANKING": 7,
    "BPO": 8,
    "BUSINESS-DEVELOPMENT": 9,
    "CHEF": 10,
    "CONSTRUCTION": 11,
    "CONSULTANT": 12,
    "DESIGNER": 13,
    "DIGITAL-MEDIA": 14,
    "ENGINEERING": 15,
    "FINANCE": 16,
    "FITNESS": 17,
    "HEALTHCARE": 18,
    "HR": 19,
    "INFORMATION-TECHNOLOGY": 20,
    "PUBLIC-RELATIONS": 21,
    "SALES": 22,
    "TEACHER": 23
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "transformers_version": "4.31.0",
  "vocab_size": 30522
}
